Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/B08B.tmx
Source language: en_us
Languages: zh_cn

source: Rumsfeld: Bush Was Wrong for Not Accepting Resignation
zh_cn: 拉姆斯菲尔德回忆录

source: Donald Rumsfeld holds the distinction of being the second-longest serving Secretary of Defense in U.S. history.
zh_cn: 拉姆斯菲尔德是美国历史上担任国防部长时间第二长的官员。

source: His most recent tenure as the civilian head of military forces began in the months before the 9/11 terrorist attacks, and ended just after the 2006 U.S. midterm elections.
zh_cn: 拉姆斯菲尔德最后一个任期开始于2001年9-11恐怖袭击事件发生的前几个月，结束于2006年中期选举之后。

source: Under President George W. Bush, he oversaw the invasions of Afghanistan and Iraq, and in a new memoir he opens up about the decisions and missteps involved in those military operations.
zh_cn: 在前总统乔治·布什任内，拉姆斯菲尔德领导了对阿富汗和伊拉克的战争。拉姆斯菲尔德在新出版的回忆录中敞开心扉，详谈美国这些军事行动的决策以及失策之处。

source: Rumsfeld admits one of the lowest points of his professional career came in 2004, when photographs surfaced showing U.S. military service members mistreating prisoners at the Abu Ghraib prison in Iraq.
zh_cn: 拉姆斯菲尔德承认，2004年是他政治生涯中最低迷的一个时刻，一些外流的照片显示美国士兵虐待伊拉克阿布格莱布监狱的囚犯。

source: "And then out of the blue come these photographs --- just heartbreaking. It is like you have been punched in the stomach.
zh_cn: 他说：“突然冒出来那些照片，我的心都碎了，感觉像被人当胸打了一拳。

source: And you think to yourself here are these wonderful young men and women in our service, and their reputations are stained by the people who abused those people that were in our custody.
zh_cn: 我们军中优秀的男女士兵，他们的名声被那些虐待在押犯的人玷污了。

source: It was disgraceful, it was perverted, it was disgusting, it was heartbreaking, and I was just sick about it," he said.
zh_cn: 那些人真可耻，真变态，让人恶心也让人心碎，我对此非常恼火。”

source: Intense international condemnation of the abuse, and public scrutiny on how the Secretary of Defense was handling the allegations, led to the first of several instances in which Rumsfeld submitted his resignation to President George. W. Bush..
zh_cn: 国际社会严厉谴责虐囚行为，公众密切关注国防部将如何处理这件事，这些都让拉姆斯菲尔德几次向布什总统提交辞呈。

source: "He rejected it, and the next day or three days later.
zh_cn: 拉姆斯菲尔德说：“布什总统拒绝我辞职。

source: I submitted it again and told him I thought that was a mistake and that I should leave. Someone's head ought to roll," Rumsfeld said.
zh_cn: 几天后，我再次递交辞呈，我告诉他，这是一个错误，我应当辞职，总得有人对此负责。”

source: In his new memoir, Rumsfeld maintains that President Bush was wrong for not accepting his resignation in the wake of the scandal.
zh_cn: 在拉姆斯菲尔德新近出版的回忆录中，他仍然认为布什总统没有因为虐囚丑闻而同意他辞职是错误的：
